app/controllers/projects_controller.rb

  def index
		@project = Project.all
---
SELECT "projects".* FROM "projects"

	def create
		@project = Project.new(params[:project])
		if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 28 Nov 2012 23:23:10 UTC +00:00], ["name", "GantiJersey"], ["updated_at", Wed, 28 Nov 2012 23:23:10 UTC +00:00]]

	def update
		@project = Project.find(params[:id])
		if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "name" = 'GantiJerseyBola', "updated_at" = '2012-11-28 23:47:41.163919' WHERE "projects"."id" = 1